#define _CRT_SECURE_NO_WARNINGS 1
#include "config.h"
#include "UI.h"
#include <windows.h> 
#include <tchar.h>
void UI() {
	int flag = 0;//UI界面的标志位
	SetConsoleTitle(_T("学生综合测试系统OVO"));//更改窗口的标题
	system("mode con: cols=100 lines=50");//更改窗口的大小
	while (flag != -1) {
		if (flag == 0) {
			system("cls");//清屏指令
			printf("                                       学 生 综 合 测 试 系 统                                       ");
			printf("\n");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("*                                                                                                  *");
			printf("*                                       1 访 问 学 生 信 息 库                                     *");
			printf("*                                                                                                  *");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("*                                                                                                  *");
			printf("*                                       2 访 问 学 生 成 绩 库                                     *");
			printf("*                                                                                                  *");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("*                                                                                                  *");
			printf("*                                      -1 退 出 系 统                                              *");
			printf("*                                                                                                  *");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("请输入对应的数字，执行功能：");
			scanf("%d", &flag);
			getchar();//吸收scanf结束时的回车符
		}
		else if (flag == 1) {
			system("cls");//清屏指令
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("*                                  1 创 建 学 生 数 据                                             *");
			printf("*                                  2 修 改 学 生 数 据                                             *");
			printf("*                                  3 删 除 学 生 数 据                                             *");
			printf("*                                  4 浏 览 学 生 数 据                                             *");
			printf("*                                  5 查 询 学 生 数 据                                             *");
			printf("*                                  0 返 回 主 界 面                                                *");
			printf("*                                 -1 退 出 系 统                                                   *");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("请输入对应的数字，执行功能：");
			scanf("%d", &flag);
			getchar();//吸收scanf结束时的回车符
			switch (flag) {
			case 1:
				system("cls");
				printf("            |            |            |            |            |                                   ");
				printf("            |            |            |            |            |                                   ");
				printf("------------+------------+------------+------------+------------+-----------------------------------");
				system("pause");
				break;
			case 2:
				break;
			case 3:
				break;
			case 4:
				break;
			case 5:
				break;
			}

		}
		else if (flag == 2) {
			system("cls");//清屏指令
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("*                               1 输 入 学 生 科 目 成 绩                                          *");
			printf("*                               2 输 入 学 生 测 评 成 绩                                          *");
			printf("*                               0 返 回 主 界 面                                                   *");
			printf("*                              -1 退 出 系 统                                                      *");
			printf("*--------------------------------------------------------------------------------------------------*");
			printf("请输入对应的数字，执行功能：");
			scanf("%d", &flag);
			getchar();//吸收scanf结束时的回车符
			switch (flag) {
			case 1:
				break;
			case 2:
				break;

			}
		}
		else if (flag == -1) {
			system("exit");//退出程序，关闭Dos窗口
		}
	}
}